#include <iostream>
#include <algorithm>    
#include <cmath>
#define genius "JerryChen"
typedef long long ll;
const ll mod = 1e9 + 7;
const ll N = 1e6 + 10;
using namespace std;

/** ------五子棋对弈------
 *  ------问题描述------
 *  在五子棋的对弈中, 友谊的小船说翻就翻？
 *  不！对小蓝和小桥来说, 五子棋不仅是棋盘上的较量, 更是心与心之间的沟通。
 *  这两位挚友秉承着 "友谊第一, 比赛第二" 的宗旨, 决定在一块 5 × 5 的棋盘上, 用黑白两色的棋子来决出胜负。
 *  但他们又都不忍心让对方失落, 于是决定用一和棋（平局）作为彼此友谊的见证。
 *  比赛遵循以下规则: 
 *  1.棋盘规模: 比赛在一个5×5的方格棋盘上进行, 共有25个格子供下棋使用。
 *  2.棋子类型: 两种棋子, 黑棋与白棋, 代表双方。小蓝持白棋, 小桥持黑棋。
 *  3.先手规则: 白棋（小蓝）具有先手优势, 即在棋盘空白时率先落子（下棋）。 
 *  4.轮流落子: 玩家们交替在棋盘上放置各自的棋子, 每次仅放置一枚。
 *  5.胜利条件: 率先在横线、竖线或斜线上形成连续的五个同色棋子的一方获胜。
 *  6.平局条件: 当所有25个棋盘格都被下满棋子, 而未决出胜负时, 游戏以平局告终。
 *  在这一设定下, 小蓝和小桥想知道, 有多少种不同的棋局情况, 既确保棋盘下满又保证比赛结果为平局。
 * 
 *  ------答案提交------
 *  这是一道结果填空题, 你只需要算出结果后提交即可。本题的结果为一个整数, 在提交答案时只填写这个整数, 填写多余的内容将无法得分。
 */

int answ[26] = { 0 }, ansb[26] = { 0 };
int main() {

	return 0;
}


